org/comsys/link_layer.org
#+TITLE: Link Layer
#+STARTUP: content
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+OPTIONS: toc:nil

* Link Layer

- PDUs dieser Schicht heißen *frames* (IP-Pakete werden also in dieser
  Schicht in frames gepackt)
- Kommunikationskonäle heißten *links*
- Host und Router heißen *nodes*

Service: Transfer von frames von einem Netzknoten zu einem adjazenten
Netzknoten über eine einzelne Verbindung.

Zur erbringung des Service sind nötig:

- framing
- link access
- flow control
- error detection 

** Error Detection

mittels eine *error detection correction* (EDC) Felds, welches der PSU
dieser Schicht hinzugefügt wird.

- source coding :: Entfernen redundanter Informationen aus der PSU
- channel coding :: Hinzufügen von Redundanz für die error detection, z.B. durch
  - Hinzufügen eines *parity bits*, dass so gewählt wird, dass sich eine
    gerade (even parity) oder ungerade (odd parity) Anzahl von Einsen
    ergibt.
  - *block parity*: parity bits für jede Zeile und jede Spalte eines
    blocks (mehr-bit-Fehler können immer noch übersehen werden)
  - 
