comsys/link_layer.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Link Layer</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>PDUs dieser Schicht heißen <b>frames</b> (IP-Pakete werden also in dieser
Schicht in frames gepackt)
</li>
<li>Kommunikationskonäle heißten <b>links</b>
</li>
<li>Host und Router heißen <b>nodes</b>
</li>
</ul>

<p>
Service: Transfer von frames von einem Netzknoten zu einem adjazenten
Netzknoten über eine einzelne Verbindung.
</p>

<p>
Zur erbringung des Service sind nötig:
</p>

<ul class="org-ul">
<li>framing
</li>
<li>link access
</li>
<li>flow control
</li>
<li>error detection 
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Error Detection</h3>
<div class="outline-text-3" id="text-1-1">
<p>
mittels eine <b>error detection correction</b> (EDC) Felds, welches der PSU
dieser Schicht hinzugefügt wird.
</p>

<dl class="org-dl">
<dt> source coding </dt><dd>Entfernen redundanter Informationen aus der PSU
</dd>
<dt> channel coding </dt><dd>Hinzufügen von Redundanz für die error detection, z.B. durch
<ul class="org-ul">
<li>Hinzufügen eines <b>parity bits</b>, dass so gewählt wird, dass sich eine
gerade (even parity) oder ungerade (odd parity) Anzahl von Einsen
ergibt.
</li>
<li><b>block parity</b>: parity bits für jede Zeile und jede Spalte eines
blocks (mehr-bit-Fehler können immer noch übersehen werden)
</li>
<li></li>
</ul>
</dd>
</dl>
</div>
</div>
</div>
